zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
// Copyright (c) Microsoft. All rights reserved.
// Licensed under the MIT license. See LICENSE file in the project root for full license information.

#ifdef __cplusplus
  #include <cstdbool>
  #include <cstddef>
  #include <cstdlib>
  #include <ctime>
#else
  #include <stdbool.h>
  #include <stddef.h>
  #include <stdlib.h>
  #include <time.h>
#endif

#ifdef _CRTDBG_MAP_ALLOC
#include <crtdbg.h>
#endif

// Test framework `#includes`
#include "testrunnerswitcher.h"
#include "umock_c.h"
#include "umocktypes_charptr.h"
#include "umocktypes_stdint.h"
#include "umock_c_negative_tests.h"

// External library dependencies
#include "driverlib.h"

#define MOCK_CLOCK_HZ 1000000
#define MOCK_NON_NULL_XIO_HANDLE (CONCRETE_IO_HANDLE)0x19790917
#define MOCK_OPTION_HANDLER (OPTIONHANDLER_HANDLE)0x19790917

static TEST_MUTEX_HANDLE g_testByTest;
static TEST_MUTEX_HANDLE g_dllByDll;

static char * uartio_rx_data;

static
void *
non_mocked_malloc(
    size_t size_
) {
    return malloc(size_);
}

static
void
non_mocked_free(
    void * block_
) {
    free(block_);
    return;
}

static
char *
umockvalue_stringify_EUSCI_A_UART_initParam(
    const EUSCI_A_UART_initParam ** value_
) {
    char * result;

    if (NULL == value_) {
        result = (char *)NULL;
    } else if (NULL == *value_) {
        result = (char *)NULL;
    } else {
        const EUSCI_A_UART_initParam * value = *value_;
        char buffer[256];
        size_t len = sprintf(
            buffer,
            "EUSCI_A_UART_initParam {\n\t.selectClockSource: 0x%02x\n\t.clockPrescalar: %u\n\t.firstModReg: %u\n\t.secondModReg: %u\n\t.parity: 0x%02x\n\t.msborLsbFirst: 0x%04x\n\t.numberofStopBits: 0x%04x\n\t.uartMode: 0x%04x\n\t.overSampling: 0x%02x\n}\n",
            value->selectClockSource,
            value->clockPrescalar,
            value->firstModReg,
            value->secondModReg,
            value->parity,
            value->msborLsbFirst,
            value->numberofStopBits,
            value->uartMode,
            value->overSampling
        );

        result = (char *)malloc(len + 1);
        strcpy(result, buffer);
    }

    return result;
}

static
int
umockvalue_are_equal_EUSCI_A_UART_initParam(
    const EUSCI_A_UART_initParam ** left_,
    const EUSCI_A_UART_initParam ** right_
) {
    bool match;

    if (NULL == left_) {
        match = false;
    } else if (NULL == right_)  {
        match = false;
    } else if (NULL == *left_)  {
        match = false;
    } else if (NULL == *right_)  {
        match = false;
    } else {
        const EUSCI_A_UART_initParam * left = *left_;
        const EUSCI_A_UART_initParam * right = *right_;
        match = true;

        match = (match && (left->selectClockSource == right->selectClockSource));
        match = (match && (left->clockPrescalar == right->clockPrescalar));
        match = (match && (left->firstModReg == right->firstModReg));
        match = (match && (left->secondModReg == right->secondModReg));
        match = (match && (left->parity == right->parity));
        match = (match && (left->msborLsbFirst == right->msborLsbFirst));
        match = (match && (left->numberofStopBits == right->numberofStopBits));
        match = (match && (left->uartMode == right->uartMode));
        match = (match && (left->overSampling == right->overSampling));
    }

    return (int)match;
}

static
int
umockvalue_copy_EUSCI_A_UART_initParam(
    EUSCI_A_UART_initParam ** destination_,
    const EUSCI_A_UART_initParam ** source_
) {
    int result;

    if (NULL == destination_) {
        result = __LINE__;
    } else if (NULL == source_) {
        result = __LINE__;
    } else if (NULL == *source_) {
        result = __LINE__;
    } else if (NULL == (*destination_ = (EUSCI_A_UART_initParam *)malloc(sizeof(EUSCI_A_UART_initParam)))) {
        result = __LINE__;
    } else {
        EUSCI_A_UART_initParam * destination = *destination_;
        const EUSCI_A_UART_initParam * source = *source_;

        if (NULL == destination) {
            result = __LINE__;
        } else if (NULL == source) {
            result = __LINE__;
        } else {
            destination->selectClockSource = source->selectClockSource;
            destination->clockPrescalar = source->clockPrescalar;
            destination->firstModReg = source->firstModReg;
            destination->secondModReg = source->secondModReg;
            destination->parity = source->parity;
            destination->msborLsbFirst = source->msborLsbFirst;
            destination->numberofStopBits = source->numberofStopBits;
            destination->uartMode = source->uartMode;
            destination->overSampling = source->overSampling;
            result = 0;
        }
    }

    return result;
}

static
void
umockvalue_free_EUSCI_A_UART_initParam(
    EUSCI_A_UART_initParam ** value_
) {
    (void)free(*value_);
}

#define ENABLE_MOCKS
  // `#include` SDK dependencies here
  #include "azure_c_shared_utility/gballoc.h"
  #include "azure_c_shared_utility/optionhandler.h"
#undef ENABLE_MOCKS

// Under test `#includes`
#include "azure_c_shared_utility/uartio.h"

pfCloneOption options_cloneoption;
pfDestroyOption options_destroyoption;

static
OPTIONHANDLER_HANDLE
mock_OptionHandler_Create(
    pfCloneOption clone_option,
    pfDestroyOption destroy_option,
    pfSetOption set_option
) {
    (void)set_option;

    options_cloneoption = clone_option;
    options_destroyoption = destroy_option;
    return MOCK_OPTION_HANDLER;
}

#define ENABLE_MOCKS
  TEST_DEFINE_ENUM_TYPE(IO_OPEN_RESULT, IO_OPEN_RESULT_VALUES);
  IMPLEMENT_UMOCK_C_ENUM_TYPE(IO_OPEN_RESULT, IO_OPEN_RESULT_VALUES);
  TEST_DEFINE_ENUM_TYPE(IO_SEND_RESULT, IO_SEND_RESULT_VALUES);
  IMPLEMENT_UMOCK_C_ENUM_TYPE(IO_SEND_RESULT, IO_SEND_RESULT_VALUES);

  // ** Mocking cs.h module (driverlib.h)
  MOCK_FUNCTION_WITH_CODE(, void, CS_enableClockRequest, uint8_t, selectClock)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, uint32_t, CS_getSMCLK)
  MOCK_FUNCTION_END(MOCK_CLOCK_HZ);

