zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
  // ** Mocking eusci_a_uart.h module (driverlib.h)
  MOCK_FUNCTION_WITH_CODE(, void, EUSCI_A_UART_disable, uint16_t, baseAddress)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, EUSCI_A_UART_disableInterrupt, uint16_t, baseAddress, uint8_t, mask)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, EUSCI_A_UART_enable, uint16_t, baseAddress)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, EUSCI_A_UART_enableInterrupt, uint16_t, baseAddress, uint8_t, mask)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, bool, EUSCI_A_UART_init, uint16_t, baseAddress, EUSCI_A_UART_initParam *, param)
  MOCK_FUNCTION_END(true);
  MOCK_FUNCTION_WITH_CODE(, uint8_t, EUSCI_A_UART_queryStatusFlags, uint16_t, baseAddress, uint8_t, mask)
  MOCK_FUNCTION_END(0x00);
  MOCK_FUNCTION_WITH_CODE(, uint8_t, EUSCI_A_UART_receiveData, uint16_t, baseAddress)
  MOCK_FUNCTION_END(0x00);
  MOCK_FUNCTION_WITH_CODE(, void, EUSCI_A_UART_transmitData, uint16_t, baseAddress, uint8_t, transmitData)
  MOCK_FUNCTION_END();

  // ** Mocking out the user callbacks
  MOCK_FUNCTION_WITH_CODE(, void, mock_on_io_open_complete, void *, context, IO_OPEN_RESULT, open_result)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, mock_on_bytes_received, void *, context, const unsigned char *, buffer, size_t, size)
      uartio_rx_data = (char *)buffer;
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, mock_on_io_error, void *, context)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, mock_on_io_close_complete, void *, context)
  MOCK_FUNCTION_END();
  MOCK_FUNCTION_WITH_CODE(, void, mock_on_send_complete, void *, context, IO_SEND_RESULT, send_result)
  MOCK_FUNCTION_END();

#undef ENABLE_MOCKS

DEFINE_ENUM_STRINGS(UMOCK_C_ERROR_CODE, UMOCK_C_ERROR_CODE_VALUES)

static void on_umock_c_error(UMOCK_C_ERROR_CODE error_code)
{
    char temp_str[256];
    (void)snprintf(temp_str, sizeof(temp_str), "umock_c reported error :%s", ENUM_TO_STRING(UMOCK_C_ERROR_CODE, error_code));
    ASSERT_FAIL(temp_str);
}

BEGIN_TEST_SUITE(uartio_msp430_unittests)

TEST_SUITE_INITIALIZE(suite_init)
{
    int result;

    TEST_INITIALIZE_MEMORY_DEBUG(g_dllByDll);
    g_testByTest = TEST_MUTEX_CREATE();
    ASSERT_IS_NOT_NULL(g_testByTest);

    result = umock_c_init(on_umock_c_error);
    ASSERT_ARE_EQUAL(int, 0, result);
    result = umocktypes_charptr_register_types();
    ASSERT_ARE_EQUAL(int, 0, result);
    result = umocktypes_stdint_register_types();
    ASSERT_ARE_EQUAL(int, 0, result);

    REGISTER_TYPE(IO_OPEN_RESULT, IO_OPEN_RESULT);
    REGISTER_TYPE(IO_SEND_RESULT, IO_SEND_RESULT);

    REGISTER_UMOCK_ALIAS_TYPE(bool, int);
    REGISTER_UMOCK_ALIAS_TYPE(OPTIONHANDLER_HANDLE, void*);
    REGISTER_UMOCK_ALIAS_TYPE(pfCloneOption, void*);
    REGISTER_UMOCK_ALIAS_TYPE(pfDestroyOption, void*);
    REGISTER_UMOCK_ALIAS_TYPE(pfSetOption, void*);

    REGISTER_UMOCK_VALUE_TYPE(EUSCI_A_UART_initParam *, umockvalue_stringify_EUSCI_A_UART_initParam, umockvalue_are_equal_EUSCI_A_UART_initParam, umockvalue_copy_EUSCI_A_UART_initParam, umockvalue_free_EUSCI_A_UART_initParam);

    REGISTER_GLOBAL_MOCK_HOOK(OptionHandler_Create, mock_OptionHandler_Create);
    REGISTER_GLOBAL_MOCK_HOOK(gballoc_malloc, non_mocked_malloc);
    REGISTER_GLOBAL_MOCK_HOOK(gballoc_free, non_mocked_free);
}

TEST_SUITE_CLEANUP(suite_cleanup)
{
    umock_c_deinit();

    TEST_MUTEX_DESTROY(g_testByTest);
    TEST_DEINITIALIZE_MEMORY_DEBUG(g_dllByDll);
}

TEST_FUNCTION_INITIALIZE(TestMethodInitialize)
{
    if (TEST_MUTEX_ACQUIRE(g_testByTest))
    {
        ASSERT_FAIL("our mutex is ABANDONED. Failure in test framework");
    }
}

TEST_FUNCTION_CLEANUP(TestMethodCleanup)
{
    TEST_MUTEX_RELEASE(g_testByTest);
}

/* uartio_get_interface_description */

/* SRS_UARTIO_27_000: [ `uartio_get_interface_description()` shall return a non-`NULL` pointer to an `IO_INTERFACE_DESCRIPTION` structure. ] */
/* SRS_UARTIO_27_001: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_close()`. ] */
/* SRS_UARTIO_27_002: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_create()`. ] */
/* SRS_UARTIO_27_003: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_destroy()`. ] */
/* SRS_UARTIO_27_004: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_dowork()`. ] */
/* SRS_UARTIO_27_005: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_open()`. ] */
/* SRS_UARTIO_27_006: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_retrieveoptions()`. ] */
/* SRS_UARTIO_27_007: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_send()`. ] */
/* SRS_UARTIO_27_008: [ `uartio_get_interface_description()` shall return a pointer to an `IO_INTERFACE_DESCRIPTION` structure that contains a pointer to `uartio_setoption()`. ] */
TEST_FUNCTION(uartio_get_interface_description_SCENARIO_success)
{
    // Arrange

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NOT_NULL(io_interface);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_close);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_create);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_destroy);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_dowork);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_open);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_retrieveoptions);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_send);
    ASSERT_IS_NOT_NULL(io_interface->concrete_io_setoption);

