zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Cleanup
}


/* uartio_cloneoption */

/* SRS_UARTIO_27_009: [ If the `option_name` argument is NULL, `uartio_cloneoption()` shall return `NULL`. ] */
TEST_FUNCTION(uartio_cloneoption_SCENARIO_NULL_option_name)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    void * result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options = io_interface->concrete_io_retrieveoptions(xio);
    ASSERT_IS_NOT_NULL(options);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = options_cloneoption(NULL, "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_010: [ If the `option_value` argument is NULL, `uartio_cloneoption()` shall return `NULL`. ] */
TEST_FUNCTION(uartio_cloneoption_SCENARIO_NULL_option_value)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    void * result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options = io_interface->concrete_io_retrieveoptions(xio);
    ASSERT_IS_NOT_NULL(options);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = options_cloneoption("Options", NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_011: [ If the `option_name` argument indicates an option that is not handled by `uartio`, then `uartio_cloneoption()` shall return `NULL`. ] */
TEST_FUNCTION(uartio_cloneoption_SCENARIO_invalid_option_name)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    void * result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options = io_interface->concrete_io_retrieveoptions(xio);
    ASSERT_IS_NOT_NULL(options);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = options_cloneoption("Options", "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}


/* uartio_close */

/* SRS_UARTIO_27_012: [ If the argument `io_handle` is NULL, `uartio_close()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_close_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_close(NULL, mock_on_io_close_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_100: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_close()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_close_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_close(MOCK_NON_NULL_XIO_HANDLE, mock_on_io_close_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_013: [ `uartio_close()` shall initiate closing the UART IO and on success it shall return 0. ] */
/* SRS_UARTIO_27_014: [ On success, `on_io_close_complete()` shall be called while passing as argument `on_io_close_complete_context`. ] */
/* SRS_UARTIO_27_101: [ `uartio_close()` shall await any outstanding bytes by polling `(uint8_t)EUSCI_A_UART_queryStatusFlags(uint16_t baseAddress, uint8_t mask)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the mask , `EUSCI_A_UART_BUSY`, until it returns an empty mask. ] */
/* SRS_UARTIO_27_102: [ `uartio_close()` shall disable the UART interrupt (while caching the ring buffer) by calling `(void)EUSCI_A_UART_disableInterrupt(uint16_t baseAddress, uint8_t mask)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the mask of the RX interrupt flag, `EUSCI_A_UART_RECEIVE_INTERRUPT`. ] */
/* SRS_UARTIO_27_103: [ `uartio_close()` shall disable the UART by calling `(void)EUSCI_A_UART_disable(uint16_t baseAddress)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`. ] */
TEST_FUNCTION(uartio_close_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int random_number, result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);
    ASSERT_ARE_EQUAL(int, 0, result);
    (void)srand((unsigned int)time(NULL));
    random_number = (rand() % 4);

    // Expected call listing
    umock_c_reset_all_calls();
    // Simulate busy UART
    for (int i = 0; i <= random_number; ++i) {
        STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, EUSCI_A_UART_BUSY))
            .SetReturn(EUSCI_A_UART_BUSY);
    }
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, EUSCI_A_UART_BUSY));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disable(EUSCI_A1_BASE));
    STRICT_EXPECTED_CALL(mock_on_io_close_complete(&result));

    // Act
    result = io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);

