zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_015: [ If the argument `on_io_close_complete` is NULL, `uartio_close()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_close_SCENARIO_NULL_on_io_close_complete)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_close(xio, NULL, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_016: [ If called when `uartio` is closed, `uartio_close()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_close_SCENARIO_close_called_twice)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);
    ASSERT_ARE_EQUAL(int, 0, result);
    result = io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}


/* uartio_create */

/* SRS_UARTIO_27_104: [ If no errors are encountered, `uartio_create()` shall return a pointer to the single static instance. ] */
TEST_FUNCTION(uartio_create_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(gballoc_malloc(sizeof(uint8_t) * config.ring_buffer_size));
    STRICT_EXPECTED_CALL(gballoc_malloc(sizeof(uint8_t) * config.ring_buffer_size));

    // Act
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NOT_NULL(xio);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_017: [ If the argument `io_create_parameters` is `NULL`, `uartio_create()` shall fail and return `NULL`. ] */
TEST_FUNCTION(uartio_create_SCENARIO_NULL_io_create_parameters)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(xio);

    // Cleanup
}

/* SRS_UARTIO_27_105: [ If the `baud_rate` member of the `UARTIO_CONFIG *` parameter is 0, then `uartio_create()` shall fail and return `NULL`. ] */
TEST_FUNCTION(uartio_create_SCENARIO_bad_parameters_baud_rate_equals_zero)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 0, 4 };

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(xio);

    // Cleanup
}

/* SRS_UARTIO_27_106: [ If the `ring_buffer_size` member of the `UARTIO_CONFIG *` parameter is 0, then `uartio_create()` shall fail and return `NULL`. ] */
TEST_FUNCTION(uartio_create_SCENARIO_bad_parameters_ring_buffer_size_equals_zero)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 0 };

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(xio);

    // Cleanup
}

/* SRS_UARTIO_27_107: [ If the `ring_buffer_size` member of the `UARTIO_CONFIG *` parameter is not a power of 2, then `uartio_create()` shall fail and return `NULL`. ] */
TEST_FUNCTION(uartio_create_SCENARIO_bad_parameters_ring_buffer_size_non_power_of_two)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 6 };

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Assert
    ASSERT_ARE_NOT_EQUAL(size_t, 0, (config.ring_buffer_size & (config.ring_buffer_size - 1)));
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(xio);

    // Cleanup
}

/* SRS_UARTIO_27_108: [ If `uartio_create()` has previously been called without subsequently calling `uartio_destroy()`, then `uartio_create()` shall fail immediately and return `NULL`. ] */
TEST_FUNCTION(uartio_create_SCENARIO_create_called_twice)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    CONCRETE_IO_HANDLE xio2 = io_interface->concrete_io_create(&config);

