zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(xio2);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_109: [ If allocating memory for the ring buffer fails, then the `uartio_create()` shall fail and return `NULL`. ] */
/* SRS_UARTIO_27_110: [ If allocating memory for the cache buffer fails, then the `uartio_create()` shall fail and return `NULL`. ] */
/* SRS_UARTIO_27_018: [ VALGRIND - When `uartio_create()` fails, all allocated resources up to that point shall be freed. ] */
TEST_FUNCTION(uartio_create_SCENARIO_negative_tests)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int negativeTestsInitResult = umock_c_negative_tests_init();
    ASSERT_ARE_EQUAL(int, 0, negativeTestsInitResult);
    UARTIO_CONFIG config = { 9600, 4 };

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(gballoc_malloc(sizeof(uint8_t) * config.ring_buffer_size))
        .SetFailReturn(NULL);
    STRICT_EXPECTED_CALL(gballoc_malloc(sizeof(uint8_t) * config.ring_buffer_size))
        .SetFailReturn(NULL);
    umock_c_negative_tests_snapshot();

    for (size_t i = 0; i < umock_c_negative_tests_call_count(); ++i)
    {
        umock_c_negative_tests_reset();
        umock_c_negative_tests_fail_call(i);

        // Act
        CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

        // Assert
        ASSERT_IS_NULL(xio);
    }

    // Cleanup
    umock_c_negative_tests_deinit();
}


/* uartio_destroy */

/* SRS_UARTIO_27_019: [ If the argument `io_handle` is `NULL`, `uartio_destroy()` shall do nothing. ] */
TEST_FUNCTION(uartio_destroy_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    (void)io_interface->concrete_io_destroy(NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_111: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_destroy()` shall do nothing. ] */
TEST_FUNCTION(uartio_destroy_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    (void)io_interface->concrete_io_destroy(MOCK_NON_NULL_XIO_HANDLE);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_112: [ `uartio_destroy()` shall free the ring buffer. ] */
/* SRS_UARTIO_27_113: [ `uartio_destroy()` shall free the cache buffer. ] */
/* SRS_UARTIO_27_020: [ `uartio_destroy()` shall close the IO if it was open before freeing all the resources. ] */
/* SRS_UARTIO_27_021: [ NO OPTIONS - All options cached via `uartio_set_option` shall also be freed. ] */
TEST_FUNCTION(uartio_destroy_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, EUSCI_A_UART_BUSY));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disable(EUSCI_A1_BASE));
    EXPECTED_CALL(gballoc_free(IGNORED_PTR_ARG));
    EXPECTED_CALL(gballoc_free(IGNORED_PTR_ARG));

    // Act
    (void)io_interface->concrete_io_destroy(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_114: [ If `uartio_destroy()` has previously been called on a handle, then `uartio_destroy()` shall do nothing. ] */
TEST_FUNCTION(uartio_destroy_SCENARIO_destory_called_twice_on_same_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    (void)io_interface->concrete_io_destroy(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    (void)io_interface->concrete_io_destroy(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}


/* uartio_destroyoption */

/* SRS_UARTIO_27_022: [ If the `option_name` argument is `NULL`, `uartio_destroyoption()` shall do nothing. ] */
TEST_FUNCTION(uartio_destroyoption_SCENARIO_NULL_option_name)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options = io_interface->concrete_io_retrieveoptions(xio);
    ASSERT_IS_NOT_NULL(options);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    options_destroyoption(NULL, "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_023: [ If the `option_value` argument is `NULL`, `uartio_destroyoption()` shall do nothing. ] */
TEST_FUNCTION(uartio_destroyoption_SCENARIO_NULL_option_value)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options = io_interface->concrete_io_retrieveoptions(xio);
    ASSERT_IS_NOT_NULL(options);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    options_destroyoption("Options", NULL);

