zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_024: [ If the `option_name` argument indicates an option that is not handled by `uartio`, then `uartio_destroyoption()` shall do nothing. ] */
TEST_FUNCTION(uartio_destroyoption_SCENARIO_invalid_option_name)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options = io_interface->concrete_io_retrieveoptions(xio);
    ASSERT_IS_NOT_NULL(options);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    options_destroyoption("Options", "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}


/* uartio_dowork */

/* SRS_UARTIO_27_025: [ If the `io_handle` argument is `NULL`, `uartio_dowork()` shall do nothing. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    (void)io_interface->concrete_io_dowork(NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_115: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_dowork()` shall do nothing. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    (void)io_interface->concrete_io_dowork(MOCK_NON_NULL_XIO_HANDLE);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
}

/* SRS_UARTIO_27_026: [ If the IO is closed (and open has not been initiated), then `uartio_dowork` shall do nothing. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_xio_closed)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    (void)io_interface->concrete_io_dowork(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_116: [ `uartio_dowork()` shall disable the UART interrupt while caching the ring buffer by calling `(void)EUSCI_A_UART_disableInterrupt(uint16_t baseAddress, uint8_t mask)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the mask of the RX interrupt flag, `EUSCI_A_UART_RECEIVE_INTERRUPT`. ] */
/* SRS_UARTIO_27_117: [ `uartio_dowork()` shall enable the UART interrupt after caching the ring buffer by calling `(void)EUSCI_A_UART_enableInterrupt(uint16_t baseAddress, uint8_t mask)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the mask of the RX interrupt flag, `EUSCI_A_UART_RECEIVE_INTERRUPT`. ] */
/* SRS_UARTIO_27_118: [ If the IO is open, `uartio_dowork()` shall indicate all bytes presented by the UART interrupt via the `on_bytes_received()` callback passed to `uartio_open()`. ] */
/* SRS_UARTIO_27_119: [ `uartio_dowork()` shall discard any bytes presented byte by the UART interrupt when the IO is closed. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    EUSCI_A_UART_initParam eusci_a_parameters = { EUSCI_A_UART_CLOCKSOURCE_SMCLK, 6, 8, 0x20, EUSCI_A_UART_NO_PARITY, EUSCI_A_UART_LSB_FIRST, EUSCI_A_UART_ONE_STOP_BIT, EUSCI_A_UART_MODE, EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Ignored UART activity
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();

    STRICT_EXPECTED_CALL(CS_enableClockRequest(CS_SMCLK));
    EXPECTED_CALL(CS_getSMCLK());
    STRICT_EXPECTED_CALL(EUSCI_A_UART_init(EUSCI_A1_BASE, &eusci_a_parameters));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enable(EUSCI_A1_BASE));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_OK));
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, &result, mock_on_io_error, &result);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Mock asynchronous UART activity
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('0');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();

    // Called during `uartio_dowork()`
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_bytes_received(&result, IGNORED_PTR_ARG, 3))
        .IgnoreArgument(2);

    // Act
    (void)io_interface->concrete_io_dowork(xio);

