zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_EQUAL(int, 0, strncmp("0\r\n", uartio_rx_data, 3));

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_120: [ If a UART framing error is detected, the error shall be indicated by calling the `on_io_error()` callback passed in `uartio_open()`, while passing the `on_io_error_context` to the callback. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_UART_framing_error)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, &result, mock_on_io_error, &result);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();

    // Mock asynchronous UART activity
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('0');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)))
        .SetReturn(EUSCI_A_UART_FRAMING_ERROR);
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();

    // Called during `uartio_dowork()`
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_bytes_received(&result, IGNORED_PTR_ARG, 3))
        .IgnoreArgument(2);
    STRICT_EXPECTED_CALL(mock_on_io_error(&result));

    // Act
    (void)io_interface->concrete_io_dowork(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_121: [ If a UART overrun error is detected, the error shall be indicated by calling the `on_io_error()` callback passed in `uartio_open()`, while passing the `on_io_error_context` to the callback. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_UART_overrun_error)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, &result, mock_on_io_error, &result);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();

    // Mock asynchronous UART activity
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('0');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)))
        .SetReturn(EUSCI_A_UART_OVERRUN_ERROR);
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();

    // Called during `uartio_dowork()`
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_bytes_received(&result, IGNORED_PTR_ARG, 3))
        .IgnoreArgument(2);
    STRICT_EXPECTED_CALL(mock_on_io_error(&result));

    // Act
    (void)io_interface->concrete_io_dowork(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_122: [ If a UART parity error is detected, the error shall be indicated by calling the `on_io_error()` callback passed in `uartio_open()`, while passing the `on_io_error_context` to the callback. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_UART_parity_error)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, &result, mock_on_io_error, &result);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();

    // Mock asynchronous UART activity
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('0');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)))
        .SetReturn(EUSCI_A_UART_PARITY_ERROR);
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();

    // Called during `uartio_dowork()`
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_bytes_received(&result, IGNORED_PTR_ARG, 3))
        .IgnoreArgument(2);
    STRICT_EXPECTED_CALL(mock_on_io_error(&result));

    // Act
    (void)io_interface->concrete_io_dowork(xio);

