zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_123: [ If a ring buffer overflow is detected, the error shall be indicated by calling the `on_io_error()` callback passed in `uartio_open()`, while passing the `on_io_error_context` to the callback. ] */
TEST_FUNCTION(uartio_dowork_SCENARIO_UART_ring_buffer_overflow)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, &result, mock_on_io_error, &result);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();

    // Mock asynchronous UART activity
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('0');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\r');
    USCI_A1_ISR();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_queryStatusFlags(EUSCI_A1_BASE, (EUSCI_A_UART_FRAMING_ERROR | EUSCI_A_UART_OVERRUN_ERROR | EUSCI_A_UART_PARITY_ERROR)));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_receiveData(EUSCI_A1_BASE))
        .SetReturn('\n');
    USCI_A1_ISR();

    // Called during `uartio_dowork()`
    STRICT_EXPECTED_CALL(EUSCI_A_UART_disableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_bytes_received(&result, IGNORED_PTR_ARG, 4))
        .IgnoreArgument(2);
    STRICT_EXPECTED_CALL(mock_on_io_error(&result));

    // Act
    (void)io_interface->concrete_io_dowork(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}


/* uartio_open */

/* SRS_UARTIO_27_027: [ If the argument `io_handle` is `NULL` then `uartio_open()` shall return a non-zero value. ] */
/* SRS_UARTIO_27_028: [ If `uartio_open()` fails, the callback `on_io_open_complete()` shall be called, while passing `on_io_open_complete_context` and `IO_OPEN_ERROR` as arguments. ] */
TEST_FUNCTION(uartio_open_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_ERROR));

    // Act
    result = io_interface->concrete_io_open(NULL, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_124: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_open()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_open_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_ERROR));

    // Act
    result = io_interface->concrete_io_open(MOCK_NON_NULL_XIO_HANDLE, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_029: [ If no errors are encountered, `uartio_open()` shall return 0. ] */
/* SRS_UARTIO_27_030: [ If `uartio_open()` succeeds, the callback `on_io_open_complete()` shall be called, while passing `on_io_open_complete_context` and `IO_OPEN_OK` as arguments. ] */
/* SRS_UARTIO_27_125: [ `uartio_open()` shall enable clock request for the submodule clock by calling `(void)CS_enableClockRequest(uint8_t selectClock)` using the `CS_SMCLK` identifier. ] */  
/* SRS_UARTIO_27_126: [ `uartio_open()` shall determine the clock speed of the submodule clock by calling `(uint32_t)CS_getSMCLK(void)`. ] */
/* SRS_UARTIO_27_127: [ `uartio_open()` shall call `(bool)EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)` using EUSCI_A_UART_CLOCKSOURCE_SMCLK as the first member of the initialization parameters. ] */
/* SRS_UARTIO_27_128: [ `uartio_open()` shall call `(bool)EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)` using EUSCI_A_UART_NO_PARITY as the fifth member of the initialization parameters. ] */
/* SRS_UARTIO_27_129: [ `uartio_open()` shall call `(bool)EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)` using EUSCI_A_UART_LSB_FIRST as the sixth member of the initialization parameters. ] */
/* SRS_UARTIO_27_130: [ `uartio_open()` shall call `(bool)EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)` using EUSCI_A_UART_ONE_STOP_BIT as the seventh member of the initialization parameters. ] */
/* SRS_UARTIO_27_131: [ `uartio_open()` shall call `(bool)EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)` using EUSCI_A_UART_MODE as the eighth member of the initialization parameters. ] */
/* SRS_UARTIO_27_132: [ `uartio_open()` shall enable the UART by calling `(void)EUSCI_A_UART_enable(uint16_t baseAddress)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`. ] */
/* SRS_UARTIO_27_133: [ `uartio_open()` shall enable the UART interrupt by calling `(void)EUSCI_A_UART_enableInterrupt(uint16_t baseAddress, uint8_t mask)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the mask of the RX interrupt flag, `EUSCI_A_UART_RECEIVE_INTERRUPT`. ] */
TEST_FUNCTION(uartio_open_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    // Parameter values based on 1000000Hz @ 9600baud
    // To understand parameter values, refer to the MSP430 User's Guide - 24.3.10 - Setting a Baud Rate
    EUSCI_A_UART_initParam eusci_a_parameters = { EUSCI_A_UART_CLOCKSOURCE_SMCLK, 6, 8, 0x20, EUSCI_A_UART_NO_PARITY, EUSCI_A_UART_LSB_FIRST, EUSCI_A_UART_ONE_STOP_BIT, EUSCI_A_UART_MODE, EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(CS_enableClockRequest(CS_SMCLK));
    EXPECTED_CALL(CS_getSMCLK());
    STRICT_EXPECTED_CALL(EUSCI_A_UART_init(EUSCI_A1_BASE, &eusci_a_parameters));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enable(EUSCI_A1_BASE));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_OK));

    // Act
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);

