zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_031: [ If the argument `on_io_open_complete` is `NULL` then `uartio_open()` shall return a non-zero value. ] */
TEST_FUNCTION(uartio_open_SCENARIO_NULL_on_io_open_complete)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_open(xio, NULL, NULL, mock_on_bytes_received, NULL, mock_on_io_error, NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_032: [ If the argument `on_bytes_received` is `NULL` then `uartio_open()` shall return a non-zero value. ] */
TEST_FUNCTION(uartio_open_SCENARIO_NULL_on_bytes_received)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_ERROR));

    // Act
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, NULL, NULL, mock_on_io_error, NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_033: [ If the argument `on_io_error` is `NULL` then `uartio_open()` shall return a non-zero value. ] */
TEST_FUNCTION(uartio_open_SCENARIO_NULL_on_io_error)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_ERROR));

    // Act
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, NULL, NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_034: [ If `uartio_open()` is called while the IO is open, `uartio_open()` shall return a non-zero value without performing any work to open the IO. ] */
TEST_FUNCTION(uartio_open_SCENARIO_call_open_twice)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_ERROR));

    // Act
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_134: [ `uartio_open()` shall fail if `false` is returned from calling `(bool)EUSCI_A_UART_init(uint16_t baseAddress, EUSCI_A_UART_initParam *param)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the calculated parameters. ] */
TEST_FUNCTION(uartio_open_SCENARIO_negative_tests)
{
    // Arrange
    int negativeTestsInitResult = umock_c_negative_tests_init();
    ASSERT_ARE_EQUAL(int, 0, negativeTestsInitResult);
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    EUSCI_A_UART_initParam eusci_a_parameters = { EUSCI_A_UART_CLOCKSOURCE_SMCLK, 6, 8, 0x20, EUSCI_A_UART_NO_PARITY, EUSCI_A_UART_LSB_FIRST, EUSCI_A_UART_ONE_STOP_BIT, EUSCI_A_UART_MODE, EUSCI_A_UART_OVERSAMPLING_BAUDRATE_GENERATION };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(CS_enableClockRequest(CS_SMCLK));
    EXPECTED_CALL(CS_getSMCLK());
    STRICT_EXPECTED_CALL(EUSCI_A_UART_init(EUSCI_A1_BASE, &eusci_a_parameters))
        .SetFailReturn(false);
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enable(EUSCI_A1_BASE));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_enableInterrupt(EUSCI_A1_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT));
    STRICT_EXPECTED_CALL(mock_on_io_open_complete(&result, IO_OPEN_ERROR));
    umock_c_negative_tests_snapshot();

    for (size_t i = 0; i < umock_c_negative_tests_call_count(); ++i)
    {
        if (i != 2) { continue; }
        umock_c_negative_tests_reset();
        umock_c_negative_tests_fail_call(i);

        // Act
        result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);

        // Assert
        ASSERT_ARE_NOT_EQUAL(int, 0, result);
    }

