zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
    umock_c_negative_tests_deinit();
}


/* uartio_retrieveoptions */

/* SRS_UARTIO_27_035: [ If parameter `io_handle` is `NULL` then `uartio_retrieveoptions()` shall fail and return `NULL`. ] */
TEST_FUNCTION(uartio_retrieveoptions_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    OPTIONHANDLER_HANDLE options;

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    options = io_interface->concrete_io_retrieveoptions(NULL);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(options);

    // Cleanup
}

/* SRS_UARTIO_27_135: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_retrieveoptions()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_retrieveoptions_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    OPTIONHANDLER_HANDLE options;

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    options = io_interface->concrete_io_retrieveoptions(MOCK_NON_NULL_XIO_HANDLE);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NULL(options);

    // Cleanup
}

/* SRS_UARTIO_27_036: [ `uartio_retrieveoptions()` shall produce an instance of `OPTIONHANDLER_HANDLE` by calling `OptionHandler_Create()`. ] */
TEST_FUNCTION(uartio_retrieveoptions_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options;

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(OptionHandler_Create(IGNORED_PTR_ARG, IGNORED_PTR_ARG, IGNORED_PTR_ARG));

    // Act
    options = io_interface->concrete_io_retrieveoptions(xio);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_IS_NOT_NULL(options);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_037: [ If producing the `OPTIONHANDLER_HANDLE` fails, then `uartio_retrieveoptions()` shall fail and return `NULL`. ] */
TEST_FUNCTION(uartio_retrieveoptions_SCENARIO_negative_tests)
{
    // Arrange
    int negativeTestsInitResult = umock_c_negative_tests_init();
    ASSERT_ARE_EQUAL(int, 0, negativeTestsInitResult);
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    OPTIONHANDLER_HANDLE options;

    // Expected call listing
    umock_c_reset_all_calls();
    EXPECTED_CALL(OptionHandler_Create(IGNORED_PTR_ARG, IGNORED_PTR_ARG, IGNORED_PTR_ARG))
        .SetFailReturn(NULL);
    umock_c_negative_tests_snapshot();

    for (size_t i = 0; i < umock_c_negative_tests_call_count(); ++i)
    {
        umock_c_negative_tests_reset();
        umock_c_negative_tests_fail_call(i);

        // Act
        options = io_interface->concrete_io_retrieveoptions(xio);

        // Assert
        ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
        ASSERT_IS_NULL(options);
    }

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
    umock_c_negative_tests_deinit();
}


/* uartio_send */

/* SRS_UARTIO_27_038: [ If the argument `io_handle` is `NULL`, `uartio_send()` shall fail and return a non-zero value. ] */
/* SRS_UARTIO_27_039: [ If `uartio_send()` fails, the callback `on_send_complete()` shall be called, while passing `on_send_complete_context` and `IO_SEND_ERROR` as arguments. ] */
TEST_FUNCTION(uartio_send_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_send_complete(&result, IO_SEND_ERROR));

    // Act
    result = io_interface->concrete_io_send(NULL, "AT", 2, mock_on_send_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_136: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_send()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_send_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_send_complete(&result, IO_SEND_ERROR));

    // Act
    result = io_interface->concrete_io_send(MOCK_NON_NULL_XIO_HANDLE, "AT", 2, mock_on_send_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_137: [ `uartio_send()` shall send each byte of `buffer` by calling `(void)EUSCI_A_UART_transmitData(uint16_t baseAddress, uint8_t transmitData)` using the baseAddress of the UART controller, `EUSCI_A1_BASE`, and the byte to be sent, `buffer_size` times. ] */
/* SRS_UARTIO_27_040: [ If `uartio_send()` completes without errors, `on_send_complete()` shall be called while passing to it the `on_send_complete_context` value and `IO_SEND_OK` as arguments. ] */
/* SRS_UARTIO_27_041: [ If `uartio_send()` completes without errors, it shall return 0. ] */
/* SRS_UARTIO_27_049: [ If the buffer passed as argument `buffer` has NULL bytes(0x00), `uartio_send()` shall send those bytes to the UART controller. ] */  
TEST_FUNCTION(uartio_send_SCENARIO_success)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);
    result = io_interface->concrete_io_open(xio, mock_on_io_open_complete, &result, mock_on_bytes_received, NULL, mock_on_io_error, NULL);
    ASSERT_ARE_EQUAL(int, 0, result);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(EUSCI_A_UART_transmitData(EUSCI_A1_BASE, 'A'));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_transmitData(EUSCI_A1_BASE, 'T'));
    STRICT_EXPECTED_CALL(EUSCI_A_UART_transmitData(EUSCI_A1_BASE, '\0'));
    STRICT_EXPECTED_CALL(mock_on_send_complete(&result, IO_SEND_OK));

    // Act
    result = io_interface->concrete_io_send(xio, "AT", sizeof("AT"), mock_on_send_complete, &result);

