zookzook/azure-c-shared-utility/tests/uartio_msp430_ut/uartio_msp430_ut.c
    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_close(xio, mock_on_io_close_complete, &result);
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_042: [ If the argument `buffer` is `NULL`, `uartio_send()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_send_SCENARIO_NULL_buffer)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_send_complete(&result, IO_SEND_ERROR));

    // Act
    result = io_interface->concrete_io_send(xio, NULL, 2, mock_on_send_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_043: [ If `buffer_size` is 0, `uartio_send()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_send_SCENARIO_buffer_size_0)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_send_complete(&result, IO_SEND_ERROR));

    // Act
    result = io_interface->concrete_io_send(xio, "AT", 0, mock_on_send_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_044: [ If parameter `on_send_complete` is NULL, `uartio_send()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_send_SCENARIO_NULL_on_send_complete)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_send(xio, "AT", 2, NULL, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_045: [ If `uartio_send()` is called when the IO is not open, `uartio_send()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_send_SCENARIO_xio_not_open)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();
    STRICT_EXPECTED_CALL(mock_on_send_complete(&result, IO_SEND_ERROR));

    // Act
    result = io_interface->concrete_io_send(xio, "AT", 2, mock_on_send_complete, &result);

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}


/* uartio_setoption */

/* SRS_UARTIO_27_046: [ If the argument `io_handle` is `NULL` `uartio_setoption()` shall return a non-zero value. ] */
TEST_FUNCTION(uartio_setoption_SCENARIO_NULL_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_setoption(NULL, "Options", "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_138: [ If the argument `io_handle` is NOT equal to the value returned by `uartio_create()`, then `uartio_setoption()` shall fail and return a non-zero value. ] */
TEST_FUNCTION(uartio_setoption_SCENARIO_invalid_handle)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_setoption(MOCK_NON_NULL_XIO_HANDLE, "Options", "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
}

/* SRS_UARTIO_27_047: [ If the argument `option_name` is `NULL` `uartio_setoption()` shall return a non-zero value. ] */
TEST_FUNCTION(uartio_setoption_SCENARIO_NULL_option_name)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_setoption(xio, NULL, "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}

/* SRS_UARTIO_27_048: [ If the `option_name` argument indicates an option that is not handled by `uartio`, then `uartio_setoption()` shall return a non-zero value. ] */
TEST_FUNCTION(uartio_setoption_SCENARIO_invalid_option_name)
{
    // Arrange
    const IO_INTERFACE_DESCRIPTION * io_interface = uartio_get_interface_description();
    int result;
    UARTIO_CONFIG config = { 9600, 4 };
    CONCRETE_IO_HANDLE xio = io_interface->concrete_io_create(&config);
    ASSERT_IS_NOT_NULL(xio);

    // Expected call listing
    umock_c_reset_all_calls();

    // Act
    result = io_interface->concrete_io_setoption(xio, "Options", "NotSupported");

    // Assert
    ASSERT_ARE_EQUAL(char_ptr, umock_c_get_expected_calls(), umock_c_get_actual_calls());
    ASSERT_ARE_NOT_EQUAL(int, 0, result);

    // Cleanup
    (void)io_interface->concrete_io_destroy(xio);
}


END_TEST_SUITE(uartio_msp430_unittests)

